hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/esb/nrf_esb.h
#define     NRF_ESB_PID_RESET_VALUE             0xFF                //!< Invalid PID value that is guaranteed to not collide with any valid PID value.
#define     NRF_ESB_PID_MAX                     3                   //!< The maximum value for PID.
#define     NRF_ESB_CRC_RESET_VALUE             0xFFFF              //!< The CRC reset value.

#define     ESB_EVT_IRQ                         SWI0_IRQn           //!< The ESB event IRQ number when running on an nRF5 device.
#define     ESB_EVT_IRQHandler                  SWI0_IRQHandler     //!< The handler for @ref ESB_EVT_IRQ when running on an nRF5 device.

#if defined(NRF52)
#define ESB_IRQ_PRIORITY_MSK                    0x07                //!< The mask used to enforce a valid IRQ priority.
#else
#define ESB_IRQ_PRIORITY_MSK                    0x03                //!< The mask used to enforce a valid IRQ priority.
#endif

/** @brief Default address configuration for ESB.
    @details Roughly equal to the nRF24Lxx default (except for the number of pipes, because more pipes are supported). */
#define NRF_ESB_ADDR_DEFAULT                                                    \
    {                                                                               \
        .base_addr_p0       = { 0xE7, 0xE7, 0xE7, 0xE7 },                           \
                              .base_addr_p1       = { 0xC2, 0xC2, 0xC2, 0xC2 },                           \
                                                    .pipe_prefixes      = { 0xE7, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8 },   \
                                                                          .addr_length        = 5,                                                    \
                                                                                                .num_pipes          = NRF_ESB_PIPE_COUNT,                                   \
                                                                                                        .rf_channel         = 2,                                                    \
                                                                                                                .rx_pipes_enabled   = 0xFF                                                  \
    }


/** @brief Default radio parameters.
    @details Roughly equal to the nRF24Lxx default parameters (except for CRC, which is set to 16 bit, and protocol, which is set to DPL). */
#define NRF_ESB_DEFAULT_CONFIG {.protocol               = NRF_ESB_PROTOCOL_ESB_DPL,         \
                                                              .mode                   = NRF_ESB_MODE_PTX,                 \
                                                                                        .event_handler          = 0,                                \
                                                                                                .bitrate                = NRF_ESB_BITRATE_2MBPS,            \
                                                                                                        .crc                    = NRF_ESB_CRC_16BIT,                \
                                                                                                                .tx_output_power        = NRF_ESB_TX_POWER_0DBM,            \
                                                                                                                        .retransmit_delay       = 250,                              \
                                                                                                                                .retransmit_count       = 3,                                \
                                                                                                                                        .tx_mode                = NRF_ESB_TXMODE_AUTO,              \
                                                                                                                                                .radio_irq_priority     = 1,                                \
                                                                                                                                                        .event_irq_priority     = 2,                                \
                                                                                                                                                                .payload_length         = 32,                               \
                                                                                                                                                                        .selective_auto_ack     = false                             \
}


/** @brief Default legacy radio parameters. Identical to the nRF24Lxx defaults. */
#define NRF_ESB_LEGACY_CONFIG  {.protocol               = NRF_ESB_PROTOCOL_ESB,             \
                                                              .mode                   = NRF_ESB_MODE_PTX,                 \
                                                                                        .event_handler          = 0,                                \
                                                                                                .bitrate                = NRF_ESB_BITRATE_2MBPS,            \
                                                                                                        .crc                    = NRF_ESB_CRC_8BIT,                 \
                                                                                                                .tx_output_power        = NRF_ESB_TX_POWER_0DBM,            \
                                                                                                                        .retransmit_delay       = 600,                              \
                                                                                                                                .retransmit_count       = 3,                                \
                                                                                                                                        .tx_mode                = NRF_ESB_TXMODE_AUTO,              \
                                                                                                                                                .radio_irq_priority     = 1,                                \
                                                                                                                                                        .event_irq_priority     = 2,                                \
                                                                                                                                                                .payload_length         = 32,                               \
                                                                                                                                                                        .selective_auto_ack     = false                             \
}


