hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/esb/nrf_esb.h
    Calling this function stops ongoing communications without changing the queues.

    @retval  NRF_SUCCESS             If Enhanced ShockBurst was suspended.
    @retval  NRF_ERROR_BUSY          If the function failed because the radio is busy.
*/
uint32_t nrf_esb_suspend(void);


/** @brief Function for disabling the Enhanced ShockBurst module.

    Calling this function disables the Enhanced ShockBurst module immediately.
    Doing so might stop ongoing communications.

    @note All queues are flushed by this function.

    @retval  NRF_SUCCESS             If Enhanced ShockBurst was disabled.
*/
uint32_t nrf_esb_disable(void);


/** @brief Function for checking if the Enhanced ShockBurst module is idle.

    @retval true                     If the module is idle.
    @retval false                    If the module is busy.
*/
bool nrf_esb_is_idle(void);


/** @brief Function for writing a payload for transmission or acknowledgement.

    This function writes a payload that is added to the queue. When the module is in PTX mode, the
    payload is queued for a regular transmission. When the module is in PRX mode, the payload
    is queued for when a packet is received that requires an acknowledgement with payload.

    @param[in]   p_payload     Pointer to the structure that contains information and state of the payload.

    @retval  NRF_SUCCESS                     If the payload was successfully queued for writing.
    @retval  NRF_ERROR_NULL                  If the required parameter was NULL.
    @retval  NRF_INVALID_STATE               If the module is not initialized.
    @retval  NRF_ERROR_NO_MEM                If the TX FIFO is full.
    @retval  NRF_ERROR_INVALID_LENGTH        If the payload length was invalid (zero or larger than the allowed maximum).
*/
uint32_t nrf_esb_write_payload(nrf_esb_payload_t const *p_payload);


/** @brief Function for reading an RX payload.

    @param[in,out]   p_payload   Pointer to the structure that contains information and state of the payload.

    @retval  NRF_SUCCESS                     If the data was read successfully.
    @retval  NRF_ERROR_NULL                  If the required parameter was NULL.
    @retval  NRF_INVALID_STATE               If the module is not initialized.
*/
uint32_t nrf_esb_read_rx_payload(nrf_esb_payload_t *p_payload);


/** @brief Function for starting transmission.

    @retval  NRF_SUCCESS                     If the TX started successfully.
    @retval  NRF_ERROR_BUFFER_EMPTY          If the TX did not start because the FIFO buffer is empty.
    @retval  NRF_ERROR_BUSY                  If the function failed because the radio is busy.
*/
uint32_t nrf_esb_start_tx(void);


/** @brief Function for starting to transmit data from the FIFO buffer.

    @retval  NRF_SUCCESS                     If the transmission was started successfully.
    @retval  NRF_ERROR_BUSY                  If the function failed because the radio is busy.
*/
uint32_t nrf_esb_start_rx(void);


/** @brief Function for stopping data reception.

    @retval  NRF_SUCCESS                     If data reception was stopped successfully.
    @retval  NRF_ESB_ERROR_NOT_IN_RX_MODE    If the function failed because the module is not in RX mode.
*/
uint32_t nrf_esb_stop_rx(void);


/** @brief Function for removing remaining items from the TX buffer.

    This function clears the TX FIFO buffer.

    @retval  NRF_SUCCESS                     If pending items in the TX buffer were successfully cleared.
    @retval  NRF_INVALID_STATE               If the module is not initialized.
*/
uint32_t nrf_esb_flush_tx(void);


/** @brief Function for removing the newest entry from the TX buffer.

    This function will remove the most recently added element from the FIFO queue.

    @retval  NRF_SUCCESS                     If the operation completed successfully.
    @retval  NRF_INVALID_STATE               If the module is not initialized.
    @retval  NRF_ERROR_BUFFER_EMPTY          If there are no items in the queue to remove.
*/
uint32_t nrf_esb_pop_tx(void);


/** @brief Function for removing the oldest entry from the TX buffer.

    This function will remove the next element scheduled to be sent from the TX FIFO queue.
    This is useful if you want to skip a packet which was never acknowledged.

    @retval  NRF_SUCCESS                     If the operation completed successfully.
    @retval  NRF_INVALID_STATE               If the module is not initialized.
    @retval  NRF_ERROR_BUFFER_EMPTY          If there are no items in the queue to remove.
*/
uint32_t nrf_esb_skip_tx(void);


/** @brief Function for removing remaining items from the RX buffer.

    @retval  NRF_SUCCESS                     If the pending items in the RX buffer were successfully cleared.
    @retval  NRF_INVALID_STATE               If the module is not initialized.
*/
uint32_t nrf_esb_flush_rx(void);


/** @brief Function for setting the length of the address.

    @param[in]       length              Length of the ESB address (in bytes).

    @retval  NRF_SUCCESS                      If the address length was set successfully.
    @retval  NRF_ERROR_INVALID_PARAM          If the address length was invalid.
    @retval  NRF_ERROR_BUSY                   If the function failed because the radio is busy.
*/
uint32_t nrf_esb_set_address_length(uint8_t length);


/** @brief Function for setting the base address for pipe 0.

    @param[in]       p_addr      Pointer to the address data.

    @retval  NRF_SUCCESS                     If the base address was set successfully.
    @retval  NRF_ERROR_BUSY                  If the function failed because the radio is busy.
    @retval  NRF_ERROR_INVALID_PARAM         If the function failed because the address given was too close to a zero address.
    @retval  NRF_ERROR_NULL                  If the required parameter was NULL.
*/
uint32_t nrf_esb_set_base_address_0(uint8_t const *p_addr);


/** @brief Function for setting the base address for pipe 1 to pipe 7.

    @param[in]       p_addr      Pointer to the address data.

    @retval  NRF_SUCCESS                     If the base address was set successfully.
    @retval  NRF_ERROR_BUSY                  If the function failed because the radio is busy.
    @retval  NRF_ERROR_INVALID_PARAM         If the function failed because the address given was too close to a zero address.
    @retval  NRF_ERROR_NULL                  If the required parameter was NULL.
*/
uint32_t nrf_esb_set_base_address_1(uint8_t const *p_addr);


/** @brief Function for setting the number of pipes and the pipe prefix addresses.

