hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/esb/nrf_esb.h
    This function configures the number of available pipes, enables the pipes,
    and sets their prefix addresses.

    @param[in]   p_prefixes      Pointer to a char array that contains the prefix for each pipe.
    @param[in]   num_pipes       Number of pipes. Must be less than or equal to @ref NRF_ESB_PIPE_COUNT.

    @retval  NRF_SUCCESS                     If the prefix addresses were set successfully.
    @retval  NRF_ERROR_BUSY                  If the function failed because the radio is busy.
    @retval  NRF_ERROR_NULL                  If a required parameter was NULL.
    @retval  NRF_ERROR_INVALID_PARAM         If an invalid number of pipes was given or if the address given was too close to a zero address.
*/
uint32_t nrf_esb_set_prefixes(uint8_t const *p_prefixes, uint8_t num_pipes);


/** @brief Function for enabling pipes.

    The @p enable_mask parameter must contain the same number of pipes as has been configured
    with @ref nrf_esb_set_prefixes. This number may not be greater than the number defined by
    @ref NRF_ESB_PIPE_COUNT

    @param   enable_mask         Bitfield mask to enable or disable pipes. Setting a bit to
                                0 disables the pipe. Setting a bit to 1 enables the pipe.

    @retval  NRF_SUCCESS                     If the pipes were enabled and disabled successfully.
    @retval  NRF_ERROR_BUSY                  If the function failed because the radio is busy.
    @retval  NRF_ERROR_INVALID_PARAM         If the function failed because the address given was too close to a zero address.
*/
uint32_t nrf_esb_enable_pipes(uint8_t enable_mask);


/** @brief Function for updating the prefix for a pipe.

    @param   pipe    Pipe for which to set the prefix.
    @param   prefix  Prefix to set for the pipe.

    @retval  NRF_SUCCESS                         If the operation completed successfully.
    @retval  NRF_ERROR_BUSY                      If the function failed because the radio is busy.
    @retval  NRF_ERROR_INVALID_PARAM             If the given pipe number was invalid or if the address given was too close to a zero address.
*/
uint32_t nrf_esb_update_prefix(uint8_t pipe, uint8_t prefix);


/** @brief Function for setting the channel to use for the radio.

    The module must be in an idle state to call this function. As a PTX, the
    application must wait for an idle state and as a PRX, the application must stop RX
    before changing the channel. After changing the channel, operation can be resumed.

    @param[in]   channel                         Channel to use for radio.

    @retval  NRF_SUCCESS                         If the operation completed successfully.
    @retval  NRF_INVALID_STATE                   If the module is not initialized.
    @retval  NRF_ERROR_BUSY                      If the module was not in idle state.
    @retval  NRF_ERROR_INVALID_PARAM             If the channel is invalid (larger than 100).
*/
uint32_t nrf_esb_set_rf_channel(uint32_t channel);


/** @brief Function for getting the current radio channel.

    @param[in, out] p_channel    Pointer to the channel data.

    @retval  NRF_SUCCESS                         If the operation completed successfully.
    @retval  NRF_ERROR_NULL                      If the required parameter was NULL.
*/
uint32_t nrf_esb_get_rf_channel(uint32_t *p_channel);


/** @brief Function for setting the radio output power.

    @param[in]   tx_output_power    Output power.

    @retval  NRF_SUCCESS                         If the operation completed successfully.
    @retval  NRF_ERROR_BUSY                      If the function failed because the radio is busy.
*/
uint32_t nrf_esb_set_tx_power(nrf_esb_tx_power_t tx_output_power);


/** @brief Function for setting the packet retransmit delay.

    @param[in]   delay                           Delay between retransmissions.

    @retval  NRF_SUCCESS                         If the operation completed successfully.
    @retval  NRF_ERROR_BUSY                      If the function failed because the radio is busy.
*/
uint32_t nrf_esb_set_retransmit_delay(uint16_t delay);


/** @brief Function for setting the number of retransmission attempts.

    @param[in]   count                           Number of retransmissions.

    @retval  NRF_SUCCESS                         If the operation completed successfully.
    @retval  NRF_ERROR_BUSY                      If the function failed because the radio is busy.
*/
uint32_t nrf_esb_set_retransmit_count(uint16_t count);


/** @brief Function for setting the radio bitrate.

    @param[in]   bitrate                         Radio bitrate.

    @retval  NRF_SUCCESS                         If the operation completed successfully.
    @retval  NRF_ERROR_BUSY                      If the function failed because the radio is busy.
*/
uint32_t nrf_esb_set_bitrate(nrf_esb_bitrate_t bitrate);


/** @brief Function for reusing a packet ID for a specific pipe.

    The ESB protocol uses a 2-bit sequence number (packet ID) to identify
    retransmitted packets. By default, the packet ID is incremented for every
    uploaded packet. Use this function to prevent this and send two different
    packets with the same packet ID.

    @param[in]   pipe                            Pipe.

    @retval  NRF_SUCCESS                         If the operation completed successfully.
    @retval  NRF_ERROR_BUSY                      If the function failed because the radio is busy.
*/
uint32_t nrf_esb_reuse_pid(uint8_t pipe);

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_ESB
